require("dotenv").config();
const { Client } = require("pg");

const client = new Client({
  host: process.env.DB_HOST,
  port: process.env.DB_PORT,
  user: process.env.DB_USER,
  password: process.env.DB_PASSWORD,
  database: process.env.DB_NAME,
});

client.connect();

const query = `
  INSERT INTO Books (Title, Genres, Authors)
  VALUES 
  ('1984', 'Наукова фантастика, Політична фікція', 'Джордж Орвелл'),
  ('Гаррі Поттер і філософський камінь', 'Фентезі', 'Джоан Роулінг'),
  ('Відьмак. Останнє бажання', 'Фентезі', 'Анджей Сапковський'),
  ('Хоббіт, або Туди і звідти', 'Фентезі', 'Джон Рональд Руел Толкін'),
  ('Гра престолів', 'Фентезі', 'Джордж Мартін'),
  ('Дюна', 'Наукова фантастика', 'Френк Герберт'),
  ('Містерії', 'Роман', 'Кнут Гамсун'),
  ('Вій', 'Готичний роман', 'Микола Гоголь'),
  ('Три товариші', 'Роман', 'Еріх Марія Ремарк'),
  ('451 градус за Фаренгейтом', 'Наукова фантастика', 'Рей Бредбері'),
  ('Шерлок Холмс', 'Детектив', 'Артур Конан Дойл'),
  ('Великий Гетсбі', 'Роман', 'Френсіс Скотт Фіцджеральд'),
  ('Віднесені вітром', 'Роман', 'Маргарет Мітчелл'),
  ('Таємничий острів', 'Наукова фантастика', 'Жюль Верн');
`;

client.query(query, (err, res) => {
  if (err) {
    console.error(err);
    return;
  }
  console.log("Data insert successful");
  client.end();
});
